Revit 2026 API

# IFCExtrusionCreationDataExtrusionDirection Property

---

The extrusion direction to generate an extrusion.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ ExtrusionDirection { get; set; }
```
```vb
Public Property ExtrusionDirection As XYZ
	Get
	Set
```
```cpp
public:
property XYZ^ ExtrusionDirection {
	XYZ^ get ();
	void set (XYZ^ value);
}
```
```fsharp
member ExtrusionDirection : XYZ with get, set
```

#### Property Value

XYZ

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

IFCExtrusionCreationData Class

Autodesk.Revit.DB.IFC Namespace